import * as z from "zod";

const loginSchema = z.object({
  username: z
    .string({
      required_error: "نام کاربری الزامی می باشد",
      invalid_type_error: "نام کاربری باید متن باشد",
    })
    .min(6, "نام کاربری حداقل باید شامل 3 کارکتر باشد")
    .max(30, "نام کاربری حداکثر باید شامل 30 کارکتر باشد")
    .regex(
      /^[a-zA-Z0-9_]+$/,
      "نام کاربری فقط می تواند شامل حروف ، اعداد و _ باشد",
    ),
  password: z
    .string({
      required_error: "گذرواژه الزامی می باشد",
      invalid_type_error: "گذرواژه باید متن باشد",
    })
    .min(8, "گذرواژه حداقل باید شامل 8 کارکتر باشد")
    .max(128, "گذرواژه حداکثر باید شامل 128 کارکتر باشد")
    .regex(/[a-z]/, "رمز عبور حداقل یک حرف کوچک باید داشته باشد")
    .regex(/[A-Z]/, "رمز عبور حداقل باید یک حرف بزرگ داشته باشد")
    .regex(/[0-9]/, "رمز عبور حداقل باید یک رقم داشته باشد")
    .regex(/[0-9]/, "رمز عبور حداقل باید یک رقم داشته باشد")
    .regex(/[^A-Za-z0-9]/, "رمز عبور حداقل باید یک کارکتر خاص مانند @#!  باشد"),
});

export default loginSchema;
