const BANKS = {
  // بانک‌های دولتی و تجاری
  603799: "بانک ملی ایران",
  589210: "بانک سپه",
  603770: "بانک صادرات ایران",
  627353: "بانک تجارت",
  585983: "بانک تجارت",
  610433: "بانک ملت",
  627961: "بانک صنعت و معدن",
  603769: "بانک کشاورزی",
  628023: "بانک مسکن",
  589463: "بانک رفاه کارگران",
  627648: "بانک توسعه صادرات ایران",
  627760: "پست بانک ایران",
  502908: "بانک توسعه تعاون",

  // بانک‌های خصوصی
  627412: "بانک اقتصاد نوین",
  622106: "بانک پارسیان",
  627884: "بانک پارسیان",
  639194: "بانک پارسیان",
  639347: "بانک پاسارگاد",
  502229: "بانک پاسارگاد",
  627488: "بانک کارآفرین",
  502910: "بانک کارآفرین",
  621986: "بانک سامان",
  639346: "بانک سینا",
  639607: "بانک سرمایه",
  502806: "بانک شهر",
  504706: "بانک شهر",
  502938: "بانک دی",
  636214: "بانک آینده",
  505785: "بانک ایران زمین",
  505416: "بانک گردشگری",
  505426: "بانک گردشگری",
  585983: "بانک خاورمیانه",

  // بانک‌های قرض‌الحسنه
  606373: "بانک قرض‌الحسنه مهر ایران",
  504172: "بانک قرض‌الحسنه رسالت",

  // موسسات اعتباری و بانک‌های ادغام شده (در بانک سپه)
  639370: "بانک مهر اقتصاد",
  639599: "بانک قوامین",
  627381: "بانک انصار",
  636949: "بانک حکمت ایرانیان",
  505809: "بانک حکمت ایرانیان",
  505801: "مؤسسه اعتباری کوثر",

  // سایر موسسات مالی و اعتباری
  606256: "مؤسسه اعتباری ملل",
  628157: "مؤسسه اعتباری توسعه",
  507677: "مؤسسه اعتباری نور",
  505801: "مؤسسه اعتباری کوثر"
};

export default BANKS;
