import { z } from "zod";

export const registerSchema = z.object({
  username: z
    .string()
    .trim()
    .min(3, "نام کاربری باید حداقل ۳ کاراکتر باشد")
    .max(20, "نام کاربری نمی‌تواند بیشتر از ۲۰ کاراکتر باشد")
    .regex(
      /^[a-zA-Z0-9_]+$/,
      "نام کاربری فقط می‌تواند شامل حروف، اعداد و زیرخط (_) باشد",
    ),

  fullName: z
    .string()
    .trim()
    .min(3, "نام کامل باید حداقل ۳ کاراکتر باشد")
    .max(50, "نام کامل نمی‌تواند بیشتر از ۵۰ کاراکتر باشد"),

  phoneNumber: z
    .string()
    .trim()
    .regex(
      /^([0-9]{10,15})$/,
      "شماره تلفن باید فقط شامل ارقام باشد و بین ۱۰ تا ۱۵ رقم باشد",
    ),

  email: z.string().trim().email("ایمیل نامعتبر است"),

  password: z
    .string()
    .min(8, "رمز عبور باید حداقل ۸ کاراکتر باشد")
    .max(50, "رمز عبور نمی‌تواند بیشتر از ۵۰ کاراکتر باشد")
    .regex(
      /^(?=.*[A-Za-z])(?=.*\d).+$/,
      "رمز عبور باید حداقل شامل یک حرف و یک عدد باشد",
    )
    .regex(/[^A-Za-z0-9]/, "رمز عبور حداقل باید یک کارکتر خاص مانند @#!  باشد"),
});
